Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa86 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x44e): GNU C 4.8.2 -mtune=generic -march=x86-64 -g -fstack-protector	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x2d1): ./api1.o-0-stub.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x0): /home/ubuntu/work/stubgen-github	
    <19>   DW_AT_low_pc      : 0x0	
    <21>   DW_AT_high_pc     : 0x4b5	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x340): __time_t	
    <32>   DW_AT_decl_file   : 1	
    <33>   DW_AT_decl_line   : 10	
    <34>   DW_AT_type        : <0x38>	
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8	
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x688): long int	
 <1><3f>: Abbrev Number: 2 (DW_TAG_typedef)
    <40>   DW_AT_name        : (indirect string, offset: 0x48c): time_t	
    <44>   DW_AT_decl_file   : 1	
    <45>   DW_AT_decl_line   : 12	
    <46>   DW_AT_type        : <0x2d>	
 <1><4a>: Abbrev Number: 4 (DW_TAG_structure_type)
    <4b>   DW_AT_name        : tm	
    <4e>   DW_AT_byte_size   : 56	
    <4f>   DW_AT_decl_file   : 1	
    <50>   DW_AT_decl_line   : 13	
    <51>   DW_AT_sibling     : <0xda>	
 <2><55>: Abbrev Number: 5 (DW_TAG_member)
    <56>   DW_AT_name        : (indirect string, offset: 0x3cf): tm_sec	
    <5a>   DW_AT_decl_file   : 1	
    <5b>   DW_AT_decl_line   : 14	
    <5c>   DW_AT_type        : <0xda>	
    <60>   DW_AT_data_member_location: 0	
 <2><61>: Abbrev Number: 5 (DW_TAG_member)
    <62>   DW_AT_name        : (indirect string, offset: 0x3af): tm_min	
    <66>   DW_AT_decl_file   : 1	
    <67>   DW_AT_decl_line   : 15	
    <68>   DW_AT_type        : <0xda>	
    <6c>   DW_AT_data_member_location: 4	
 <2><6d>: Abbrev Number: 5 (DW_TAG_member)
    <6e>   DW_AT_name        : (indirect string, offset: 0x1fb): tm_hour	
    <72>   DW_AT_decl_file   : 1	
    <73>   DW_AT_decl_line   : 16	
    <74>   DW_AT_type        : <0xda>	
    <78>   DW_AT_data_member_location: 8	
 <2><79>: Abbrev Number: 5 (DW_TAG_member)
    <7a>   DW_AT_name        : (indirect string, offset: 0x74e): tm_mday	
    <7e>   DW_AT_decl_file   : 1	
    <7f>   DW_AT_decl_line   : 17	
    <80>   DW_AT_type        : <0xda>	
    <84>   DW_AT_data_member_location: 12	
 <2><85>: Abbrev Number: 5 (DW_TAG_member)
    <86>   DW_AT_name        : (indirect string, offset: 0x615): tm_mon	
    <8a>   DW_AT_decl_file   : 1	
    <8b>   DW_AT_decl_line   : 18	
    <8c>   DW_AT_type        : <0xda>	
    <90>   DW_AT_data_member_location: 16	
 <2><91>: Abbrev Number: 5 (DW_TAG_member)
    <92>   DW_AT_name        : (indirect string, offset: 0x64d): tm_year	
    <96>   DW_AT_decl_file   : 1	
    <97>   DW_AT_decl_line   : 19	
    <98>   DW_AT_type        : <0xda>	
    <9c>   DW_AT_data_member_location: 20	
 <2><9d>: Abbrev Number: 5 (DW_TAG_member)
    <9e>   DW_AT_name        : (indirect string, offset: 0x123): tm_wday	
    <a2>   DW_AT_decl_file   : 1	
    <a3>   DW_AT_decl_line   : 20	
    <a4>   DW_AT_type        : <0xda>	
    <a8>   DW_AT_data_member_location: 24	
 <2><a9>: Abbrev Number: 5 (DW_TAG_member)
    <aa>   DW_AT_name        : (indirect string, offset: 0x3e4): tm_yday	
    <ae>   DW_AT_decl_file   : 1	
    <af>   DW_AT_decl_line   : 21	
    <b0>   DW_AT_type        : <0xda>	
    <b4>   DW_AT_data_member_location: 28	
 <2><b5>: Abbrev Number: 5 (DW_TAG_member)
    <b6>   DW_AT_name        : (indirect string, offset: 0x3db): tm_isdst	
    <ba>   DW_AT_decl_file   : 1	
    <bb>   DW_AT_decl_line   : 22	
    <bc>   DW_AT_type        : <0xda>	
    <c0>   DW_AT_data_member_location: 32	
 <2><c1>: Abbrev Number: 5 (DW_TAG_member)
    <c2>   DW_AT_name        : (indirect string, offset: 0x28e): tm_gmtoff	
    <c6>   DW_AT_decl_file   : 1	
    <c7>   DW_AT_decl_line   : 23	
    <c8>   DW_AT_type        : <0x38>	
    <cc>   DW_AT_data_member_location: 40	
 <2><cd>: Abbrev Number: 5 (DW_TAG_member)
    <ce>   DW_AT_name        : (indirect string, offset: 0x22c): tm_zone	
    <d2>   DW_AT_decl_file   : 1	
    <d3>   DW_AT_decl_line   : 24	
    <d4>   DW_AT_type        : <0xe1>	
    <d8>   DW_AT_data_member_location: 48	
 <2><d9>: Abbrev Number: 0
 <1><da>: Abbrev Number: 6 (DW_TAG_base_type)
    <db>   DW_AT_byte_size   : 4	
    <dc>   DW_AT_encoding    : 5	(signed)
    <dd>   DW_AT_name        : int	
 <1><e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e2>   DW_AT_byte_size   : 8	
    <e3>   DW_AT_type        : <0xe7>	
 <1><e7>: Abbrev Number: 8 (DW_TAG_const_type)
    <e8>   DW_AT_type        : <0xec>	
 <1><ec>: Abbrev Number: 3 (DW_TAG_base_type)
    <ed>   DW_AT_byte_size   : 1	
    <ee>   DW_AT_encoding    : 6	(signed char)
    <ef>   DW_AT_name        : (indirect string, offset: 0x439): char	
 <1><f3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f4>   DW_AT_name        : (indirect string, offset: 0x655): field	
    <f8>   DW_AT_byte_size   : 4	
    <f9>   DW_AT_decl_file   : 1	
    <fa>   DW_AT_decl_line   : 34	
    <fb>   DW_AT_sibling     : <0x10c>	
 <2><ff>: Abbrev Number: 5 (DW_TAG_member)
    <100>   DW_AT_name        : (indirect string, offset: 0xb9): int_field_x	
    <104>   DW_AT_decl_file   : 1	
    <105>   DW_AT_decl_line   : 35	
    <106>   DW_AT_type        : <0xda>	
    <10a>   DW_AT_data_member_location: 0	
 <2><10b>: Abbrev Number: 0
 <1><10c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <10d>   DW_AT_name        : (indirect string, offset: 0x19a): _mystruct	
    <111>   DW_AT_byte_size   : 8	
    <112>   DW_AT_decl_file   : 1	
    <113>   DW_AT_decl_line   : 41	
    <114>   DW_AT_sibling     : <0x131>	
 <2><118>: Abbrev Number: 5 (DW_TAG_member)
    <119>   DW_AT_name        : (indirect string, offset: 0x134): int_x	
    <11d>   DW_AT_decl_file   : 1	
    <11e>   DW_AT_decl_line   : 42	
    <11f>   DW_AT_type        : <0xda>	
    <123>   DW_AT_data_member_location: 0	
 <2><124>: Abbrev Number: 5 (DW_TAG_member)
    <125>   DW_AT_name        : (indirect string, offset: 0x6e6): myfield	
    <129>   DW_AT_decl_file   : 1	
    <12a>   DW_AT_decl_line   : 43	
    <12b>   DW_AT_type        : <0xf3>	
    <12f>   DW_AT_data_member_location: 4	
 <2><130>: Abbrev Number: 0
 <1><131>: Abbrev Number: 2 (DW_TAG_typedef)
    <132>   DW_AT_name        : (indirect string, offset: 0x12b): mystruct	
    <136>   DW_AT_decl_file   : 1	
    <137>   DW_AT_decl_line   : 49	
    <138>   DW_AT_type        : <0x10c>	
 <1><13c>: Abbrev Number: 2 (DW_TAG_typedef)
    <13d>   DW_AT_name        : (indirect string, offset: 0x71a): t_tm	
    <141>   DW_AT_decl_file   : 1	
    <142>   DW_AT_decl_line   : 50	
    <143>   DW_AT_type        : <0x4a>	
 <1><147>: Abbrev Number: 2 (DW_TAG_typedef)
    <148>   DW_AT_name        : (indirect string, offset: 0x743): MyFunction	
    <14c>   DW_AT_decl_file   : 1	
    <14d>   DW_AT_decl_line   : 51	
    <14e>   DW_AT_type        : <0x152>	
 <1><152>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <153>   DW_AT_byte_size   : 8	
    <154>   DW_AT_type        : <0x158>	
 <1><158>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <159>   DW_AT_type        : <0xda>	
    <15d>   DW_AT_sibling     : <0x163>	
 <2><161>: Abbrev Number: 11 (DW_TAG_unspecified_parameters)
 <2><162>: Abbrev Number: 0
 <1><163>: Abbrev Number: 2 (DW_TAG_typedef)
    <164>   DW_AT_name        : (indirect string, offset: 0x142): STUBGEN_static_function_should_not_be_identified_as_stub_target_CALLBACK	
    <168>   DW_AT_decl_file   : 1	
    <169>   DW_AT_decl_line   : 59	
    <16a>   DW_AT_type        : <0x16e>	
 <1><16e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <16f>   DW_AT_byte_size   : 8	
    <170>   DW_AT_type        : <0x174>	
 <1><174>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <175>   DW_AT_prototyped  : 1	
    <175>   DW_AT_type        : <0xda>	
    <179>   DW_AT_sibling     : <0x188>	
 <2><17d>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <17e>   DW_AT_type        : <0xda>	
 <2><182>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <183>   DW_AT_type        : <0xda>	
 <2><187>: Abbrev Number: 0
 <1><188>: Abbrev Number: 2 (DW_TAG_typedef)
    <189>   DW_AT_name        : (indirect string, offset: 0x1e5): STUBGEN_api1_CALLBACK	
    <18d>   DW_AT_decl_file   : 1	
    <18e>   DW_AT_decl_line   : 74	
    <18f>   DW_AT_type        : <0x193>	
 <1><193>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <194>   DW_AT_byte_size   : 8	
    <195>   DW_AT_type        : <0x199>	
 <1><199>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <19a>   DW_AT_prototyped  : 1	
    <19a>   DW_AT_sibling     : <0x1a9>	
 <2><19e>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <19f>   DW_AT_type        : <0xda>	
 <2><1a3>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1a4>   DW_AT_type        : <0xda>	
 <2><1a8>: Abbrev Number: 0
 <1><1a9>: Abbrev Number: 2 (DW_TAG_typedef)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x21): STUBGEN_api1_constparam_CALLBACK	
    <1ae>   DW_AT_decl_file   : 1	
    <1af>   DW_AT_decl_line   : 89	
    <1b0>   DW_AT_type        : <0x1b4>	
 <1><1b4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1b5>   DW_AT_byte_size   : 8	
    <1b6>   DW_AT_type        : <0x1ba>	
 <1><1ba>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <1bb>   DW_AT_prototyped  : 1	
    <1bb>   DW_AT_sibling     : <0x1ca>	
 <2><1bf>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1c0>   DW_AT_type        : <0x1ca>	
 <2><1c4>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1c5>   DW_AT_type        : <0xda>	
 <2><1c9>: Abbrev Number: 0
 <1><1ca>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1cb>   DW_AT_byte_size   : 8	
    <1cc>   DW_AT_type        : <0x1d0>	
 <1><1d0>: Abbrev Number: 8 (DW_TAG_const_type)
    <1d1>   DW_AT_type        : <0xda>	
 <1><1d5>: Abbrev Number: 2 (DW_TAG_typedef)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x6ab): STUBGEN_api1_pStructtype_CALLBACK	
    <1da>   DW_AT_decl_file   : 1	
    <1db>   DW_AT_decl_line   : 104	
    <1dc>   DW_AT_type        : <0x1e0>	
 <1><1e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e1>   DW_AT_byte_size   : 8	
    <1e2>   DW_AT_type        : <0x1e6>	
