Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x3ee (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x103): GNU C 4.8.2 -mtune=generic -march=x86-64 -g -fPIC -fstack-protector	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x293): src/api1.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x9d): /home/ubuntu/work/stubgen-github/tests/sample-lib	
    <19>   DW_AT_low_pc      : 0x0	
    <21>   DW_AT_high_pc     : 0x147	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 8	
    <2f>   DW_AT_encoding    : 7	(unsigned)
    <30>   DW_AT_name        : (indirect string, offset: 0x25f): long unsigned int	
 <1><34>: Abbrev Number: 2 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 1	
    <36>   DW_AT_encoding    : 8	(unsigned char)
    <37>   DW_AT_name        : (indirect string, offset: 0x1b4): unsigned char	
 <1><3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 2	
    <3d>   DW_AT_encoding    : 7	(unsigned)
    <3e>   DW_AT_name        : (indirect string, offset: 0x1f0): short unsigned int	
 <1><42>: Abbrev Number: 2 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 4	
    <44>   DW_AT_encoding    : 7	(unsigned)
    <45>   DW_AT_name        : (indirect string, offset: 0x1d6): unsigned int	
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1	
    <4b>   DW_AT_encoding    : 6	(signed char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x1c2): signed char	
 <1><50>: Abbrev Number: 2 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2	
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0x52): short int	
 <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 4	
    <59>   DW_AT_encoding    : 5	(signed)
    <5a>   DW_AT_name        : int	
 <1><5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 8	
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x162): long int	
 <1><65>: Abbrev Number: 2 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 8	
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x5c): sizetype	
 <1><6c>: Abbrev Number: 4 (DW_TAG_typedef)
    <6d>   DW_AT_name        : (indirect string, offset: 0x276): __time_t	
    <71>   DW_AT_decl_file   : 2	
    <72>   DW_AT_decl_line   : 139	
    <73>   DW_AT_type        : <0x5e>	
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 1	
    <79>   DW_AT_encoding    : 6	(signed char)
    <7a>   DW_AT_name        : (indirect string, offset: 0x218): char	
 <1><7e>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f>   DW_AT_name        : (indirect string, offset: 0xe1): time_t	
    <83>   DW_AT_decl_file   : 3	
    <84>   DW_AT_decl_line   : 75	
    <85>   DW_AT_type        : <0x6c>	
 <1><89>: Abbrev Number: 5 (DW_TAG_structure_type)
    <8a>   DW_AT_name        : tm	
    <8d>   DW_AT_byte_size   : 56	
    <8e>   DW_AT_decl_file   : 3	
    <8f>   DW_AT_decl_line   : 133	
    <90>   DW_AT_sibling     : <0x119>	
 <2><94>: Abbrev Number: 6 (DW_TAG_member)
    <95>   DW_AT_name        : (indirect string, offset: 0x29e): tm_sec	
    <99>   DW_AT_decl_file   : 3	
    <9a>   DW_AT_decl_line   : 135	
    <9b>   DW_AT_type        : <0x57>	
    <9f>   DW_AT_data_member_location: 0	
 <2><a0>: Abbrev Number: 6 (DW_TAG_member)
    <a1>   DW_AT_name        : (indirect string, offset: 0x248): tm_min	
    <a5>   DW_AT_decl_file   : 3	
    <a6>   DW_AT_decl_line   : 136	
    <a7>   DW_AT_type        : <0x57>	
    <ab>   DW_AT_data_member_location: 4	
 <2><ac>: Abbrev Number: 6 (DW_TAG_member)
    <ad>   DW_AT_name        : (indirect string, offset: 0xf4): tm_hour	
    <b1>   DW_AT_decl_file   : 3	
    <b2>   DW_AT_decl_line   : 137	
    <b3>   DW_AT_type        : <0x57>	
    <b7>   DW_AT_data_member_location: 8	
 <2><b8>: Abbrev Number: 6 (DW_TAG_member)
    <b9>   DW_AT_name        : (indirect string, offset: 0x1e3): tm_mday	
    <bd>   DW_AT_decl_file   : 3	
    <be>   DW_AT_decl_line   : 138	
    <bf>   DW_AT_type        : <0x57>	
    <c3>   DW_AT_data_member_location: 12	
 <2><c4>: Abbrev Number: 6 (DW_TAG_member)
    <c5>   DW_AT_name        : (indirect string, offset: 0xfc): tm_mon	
    <c9>   DW_AT_decl_file   : 3	
    <ca>   DW_AT_decl_line   : 139	
    <cb>   DW_AT_type        : <0x57>	
    <cf>   DW_AT_data_member_location: 16	
 <2><d0>: Abbrev Number: 6 (DW_TAG_member)
    <d1>   DW_AT_name        : (indirect string, offset: 0x1ce): tm_year	
    <d5>   DW_AT_decl_file   : 3	
    <d6>   DW_AT_decl_line   : 140	
    <d7>   DW_AT_type        : <0x57>	
    <db>   DW_AT_data_member_location: 20	
 <2><dc>: Abbrev Number: 6 (DW_TAG_member)
    <dd>   DW_AT_name        : (indirect string, offset: 0xcf): tm_wday	
    <e1>   DW_AT_decl_file   : 3	
    <e2>   DW_AT_decl_line   : 141	
    <e3>   DW_AT_type        : <0x57>	
    <e7>   DW_AT_data_member_location: 24	
 <2><e8>: Abbrev Number: 6 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x233): tm_yday	
    <ed>   DW_AT_decl_file   : 3	
    <ee>   DW_AT_decl_line   : 142	
    <ef>   DW_AT_type        : <0x57>	
    <f3>   DW_AT_data_member_location: 28	
 <2><f4>: Abbrev Number: 6 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0x256): tm_isdst	
    <f9>   DW_AT_decl_file   : 3	
    <fa>   DW_AT_decl_line   : 143	
    <fb>   DW_AT_type        : <0x57>	
    <ff>   DW_AT_data_member_location: 32	
 <2><100>: Abbrev Number: 6 (DW_TAG_member)
    <101>   DW_AT_name        : (indirect string, offset: 0xd7): tm_gmtoff	
    <105>   DW_AT_decl_file   : 3	
    <106>   DW_AT_decl_line   : 146	
    <107>   DW_AT_type        : <0x5e>	
    <10b>   DW_AT_data_member_location: 40	
 <2><10c>: Abbrev Number: 6 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0x0): tm_zone	
    <111>   DW_AT_decl_file   : 3	
    <112>   DW_AT_decl_line   : 147	
    <113>   DW_AT_type        : <0x119>	
    <117>   DW_AT_data_member_location: 48	
 <2><118>: Abbrev Number: 0
 <1><119>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <11a>   DW_AT_byte_size   : 8	
    <11b>   DW_AT_type        : <0x11f>	
 <1><11f>: Abbrev Number: 8 (DW_TAG_const_type)
    <120>   DW_AT_type        : <0x77>	
 <1><124>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <125>   DW_AT_byte_size   : 8	
    <126>   DW_AT_type        : <0x12a>	
 <1><12a>: Abbrev Number: 8 (DW_TAG_const_type)
    <12b>   DW_AT_type        : <0x57>	
 <1><12f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <130>   DW_AT_name        : (indirect string, offset: 0xe8): field	
    <134>   DW_AT_byte_size   : 4	
    <135>   DW_AT_decl_file   : 4	
    <136>   DW_AT_decl_line   : 10	
    <137>   DW_AT_sibling     : <0x148>	
 <2><13b>: Abbrev Number: 6 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0x27f): int_field_x	
    <140>   DW_AT_decl_file   : 4	
    <141>   DW_AT_decl_line   : 11	
    <142>   DW_AT_type        : <0x57>	
    <146>   DW_AT_data_member_location: 0	
 <2><147>: Abbrev Number: 0
 <1><148>: Abbrev Number: 9 (DW_TAG_structure_type)
    <149>   DW_AT_name        : (indirect string, offset: 0x171): _mystruct	
    <14d>   DW_AT_byte_size   : 8	
    <14e>   DW_AT_decl_file   : 4	
    <14f>   DW_AT_decl_line   : 14	
    <150>   DW_AT_sibling     : <0x16d>	
 <2><154>: Abbrev Number: 6 (DW_TAG_member)
    <155>   DW_AT_name        : (indirect string, offset: 0x1a3): int_x	
    <159>   DW_AT_decl_file   : 4	
    <15a>   DW_AT_decl_line   : 15	
    <15b>   DW_AT_type        : <0x57>	
    <15f>   DW_AT_data_member_location: 0	
 <2><160>: Abbrev Number: 6 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x28b): myfield	
    <165>   DW_AT_decl_file   : 4	
    <166>   DW_AT_decl_line   : 16	
    <167>   DW_AT_type        : <0x12f>	
    <16b>   DW_AT_data_member_location: 4	
 <2><16c>: Abbrev Number: 0
 <1><16d>: Abbrev Number: 4 (DW_TAG_typedef)
    <16e>   DW_AT_name        : (indirect string, offset: 0x2a): mystruct	
    <172>   DW_AT_decl_file   : 4	
    <173>   DW_AT_decl_line   : 17	
    <174>   DW_AT_type        : <0x148>	
 <1><178>: Abbrev Number: 4 (DW_TAG_typedef)
    <179>   DW_AT_name        : (indirect string, offset: 0x21d): t_tm	
    <17d>   DW_AT_decl_file   : 1	
    <17e>   DW_AT_decl_line   : 47	
    <17f>   DW_AT_type        : <0x89>	
 <1><183>: Abbrev Number: 4 (DW_TAG_typedef)
    <184>   DW_AT_name        : (indirect string, offset: 0x1a9): MyFunction	
    <188>   DW_AT_decl_file   : 1	
    <189>   DW_AT_decl_line   : 60	
    <18a>   DW_AT_type        : <0x18e>	
 <1><18e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18f>   DW_AT_byte_size   : 8	
    <190>   DW_AT_type        : <0x194>	
 <1><194>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <195>   DW_AT_prototyped  : 1	
    <195>   DW_AT_type        : <0x57>	
    <199>   DW_AT_sibling     : <0x1a3>	
 <2><19d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <19e>   DW_AT_type        : <0x57>	
 <2><1a2>: Abbrev Number: 0
 <1><1a3>: Abbrev Number: 12 (DW_TAG_subprogram)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x65): static_function_should_not_be_identified_as_stub_target	
    <1a8>   DW_AT_decl_file   : 1	
    <1a9>   DW_AT_decl_line   : 4	
    <1aa>   DW_AT_prototyped  : 1	
    <1aa>   DW_AT_type        : <0x57>	
    <1ae>   DW_AT_low_pc      : 0x0	
    <1b6>   DW_AT_high_pc     : 0xe	
    <1be>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1c0>   DW_AT_GNU_all_call_sites: 1	
    <1c0>   DW_AT_sibling     : <0x1d1>	
 <2><1c4>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1c5>   DW_AT_name        : x	
    <1c7>   DW_AT_decl_file   : 1	
    <1c8>   DW_AT_decl_line   : 4	
    <1c9>   DW_AT_type        : <0x57>	
    <1cd>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1d0>: Abbrev Number: 0
 <1><1d1>: Abbrev Number: 14 (DW_TAG_subprogram)
    <1d2>   DW_AT_external    : 1	
    <1d2>   DW_AT_name        : (indirect string, offset: 0x33): api1	
    <1d6>   DW_AT_decl_file   : 1	
    <1d7>   DW_AT_decl_line   : 9	
    <1d8>   DW_AT_prototyped  : 1	
    <1d8>   DW_AT_low_pc      : 0xe	
    <1e0>   DW_AT_high_pc     : 0x19	
    <1e8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1ea>   DW_AT_GNU_all_tail_call_sites: 1	
    <1ea>   DW_AT_sibling     : <0x208>	
 <2><1ee>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1ef>   DW_AT_name        : x	
    <1f1>   DW_AT_decl_file   : 1	
    <1f2>   DW_AT_decl_line   : 9	
    <1f3>   DW_AT_type        : <0x57>	
    <1f7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1fa>: Abbrev Number: 15 (DW_TAG_subprogram)
    <1fb>   DW_AT_external    : 1	
    <1fb>   DW_AT_name        : (indirect string, offset: 0x1eb): puts	
    <1ff>   DW_AT_decl_file   : 5	
    <200>   DW_AT_decl_line   : 0	
    <201>   DW_AT_type        : <0x57>	
    <205>   DW_AT_declaration : 1	
 <3><205>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <3><206>: Abbrev Number: 0
 <2><207>: Abbrev Number: 0
 <1><208>: Abbrev Number: 14 (DW_TAG_subprogram)
    <209>   DW_AT_external    : 1	
    <209>   DW_AT_name        : (indirect string, offset: 0x183): api1_constparam	
    <20d>   DW_AT_decl_file   : 1	
    <20e>   DW_AT_decl_line   : 14	
    <20f>   DW_AT_prototyped  : 1	
    <20f>   DW_AT_low_pc      : 0x27	
    <217>   DW_AT_high_pc     : 0x1a	
    <21f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <221>   DW_AT_GNU_all_tail_call_sites: 1	
    <221>   DW_AT_sibling     : <0x241>	
 <2><225>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <226>   DW_AT_name        : (indirect string, offset: 0x213): pc_x	
    <22a>   DW_AT_decl_file   : 1	
    <22b>   DW_AT_decl_line   : 14	
    <22c>   DW_AT_type        : <0x124>	
