Contents of the .eh_frame section:

00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b

  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 0000000000000024 0000001c FDE cie=00000000 pc=00000000000008c0..0000000000000910
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 6 to 00000000000008c6
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 10 to 00000000000008d0
  DW_CFA_def_cfa_expression (DW_OP_breg7 (rsp): 8; DW_OP_breg16 (rip): 0; DW_OP_lit15; DW_OP_and; DW_OP_lit11; DW_OP_ge; DW_OP_lit3; DW_OP_shl; DW_OP_plus)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000040 000000000000001c 00000044 FDE cie=00000000 pc=00000000000009f5..0000000000000a03
  DW_CFA_advance_loc: 1 to 00000000000009f6
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 00000000000009f9
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 9 to 0000000000000a02
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000060 000000000000001c 00000064 FDE cie=00000000 pc=0000000000000a03..0000000000000a1c
  DW_CFA_advance_loc: 1 to 0000000000000a04
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000a07
  DW_CFA_def_cfa_register: r6 (rbp)

000001a0 000000000000001c 000001a4 FDE cie=00000000 pc=0000000000000b2c..0000000000000b3c
  DW_CFA_advance_loc: 1 to 0000000000000b2d
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000b30
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 11 to 0000000000000b3b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000001c0 000000000000001c 000001c4 FDE cie=00000000 pc=0000000000000b3c..0000000000000b55
  DW_CFA_advance_loc: 1 to 0000000000000b3d
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000b40
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 20 to 0000000000000b54
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000001e0 000000000000001c 000001e4 FDE cie=00000000 pc=0000000000000b55..0000000000000b5f
  DW_CFA_advance_loc: 1 to 0000000000000b56
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000b59
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 5 to 0000000000000b5e
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000200 000000000000001c 00000204 FDE cie=00000000 pc=0000000000000b5f..0000000000000b78
  DW_CFA_advance_loc: 1 to 0000000000000b60
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000b63
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 20 to 0000000000000b77
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000220 ZERO terminator


Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    00000000000009f5 0000000000000147 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x3f2
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000000b3c 0000000000000023 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x50e
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000000b5f 0000000000000019 
    0000000000000000 0000000000000000 

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x3ee (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xed): GNU C 4.8.2 -mtune=generic -march=x86-64 -g -fPIC -fstack-protector	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x248): src/api1.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x94): /home/ubuntu/work/stubgen-github/tests/sample-lib	
    <19>   DW_AT_low_pc      : 0x9f5	
    <21>   DW_AT_high_pc     : 0x147	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 8	
    <2f>   DW_AT_encoding    : 7	(unsigned)
    <30>   DW_AT_name        : (indirect string, offset: 0x219): long unsigned int	
 <1><34>: Abbrev Number: 2 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 1	
    <36>   DW_AT_encoding    : 8	(unsigned char)
    <37>   DW_AT_name        : (indirect string, offset: 0x19e): unsigned char	
 <1><3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 2	
    <3d>   DW_AT_encoding    : 7	(unsigned)
    <3e>   DW_AT_name        : (indirect string, offset: 0x1c1): short unsigned int	
 <1><42>: Abbrev Number: 2 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 4	
    <44>   DW_AT_encoding    : 7	(unsigned)
    <45>   DW_AT_name        : (indirect string, offset: 0x21e): unsigned int	
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1	
    <4b>   DW_AT_encoding    : 6	(signed char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x1a0): signed char	
 <1><50>: Abbrev Number: 2 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2	
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0x49): short int	
 <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 4	
    <59>   DW_AT_encoding    : 5	(signed)
    <5a>   DW_AT_name        : int	
 <1><5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 8	
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x14c): long int	
 <1><65>: Abbrev Number: 2 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 8	
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x53): sizetype	
 <1><6c>: Abbrev Number: 4 (DW_TAG_typedef)
    <6d>   DW_AT_name        : (indirect string, offset: 0x22b): __time_t	
    <71>   DW_AT_decl_file   : 2	
    <72>   DW_AT_decl_line   : 139	
    <73>   DW_AT_type        : <0x5e>	
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 1	
    <79>   DW_AT_encoding    : 6	(signed char)
    <7a>   DW_AT_name        : (indirect string, offset: 0x1a7): char	
 <1><7e>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f>   DW_AT_name        : (indirect string, offset: 0x22d): time_t	
    <83>   DW_AT_decl_file   : 3	
    <84>   DW_AT_decl_line   : 75	
    <85>   DW_AT_type        : <0x6c>	
 <1><89>: Abbrev Number: 5 (DW_TAG_structure_type)
    <8a>   DW_AT_name        : tm	
    <8d>   DW_AT_byte_size   : 56	
    <8e>   DW_AT_decl_file   : 3	
    <8f>   DW_AT_decl_line   : 133	
    <90>   DW_AT_sibling     : <0x119>	
 <2><94>: Abbrev Number: 6 (DW_TAG_member)
    <95>   DW_AT_name        : (indirect string, offset: 0x253): tm_sec	
    <99>   DW_AT_decl_file   : 3	
    <9a>   DW_AT_decl_line   : 135	
    <9b>   DW_AT_type        : <0x57>	
    <9f>   DW_AT_data_member_location: 0	
 <2><a0>: Abbrev Number: 6 (DW_TAG_member)
    <a1>   DW_AT_name        : (indirect string, offset: 0x202): tm_min	
    <a5>   DW_AT_decl_file   : 3	
    <a6>   DW_AT_decl_line   : 136	
    <a7>   DW_AT_type        : <0x57>	
    <ab>   DW_AT_data_member_location: 4	
 <2><ac>: Abbrev Number: 6 (DW_TAG_member)
    <ad>   DW_AT_name        : (indirect string, offset: 0xde): tm_hour	
    <b1>   DW_AT_decl_file   : 3	
    <b2>   DW_AT_decl_line   : 137	
    <b3>   DW_AT_type        : <0x57>	
    <b7>   DW_AT_data_member_location: 8	
 <2><b8>: Abbrev Number: 6 (DW_TAG_member)
    <b9>   DW_AT_name        : (indirect string, offset: 0x1b4): tm_mday	
    <bd>   DW_AT_decl_file   : 3	
    <be>   DW_AT_decl_line   : 138	
    <bf>   DW_AT_type        : <0x57>	
    <c3>   DW_AT_data_member_location: 12	
 <2><c4>: Abbrev Number: 6 (DW_TAG_member)
    <c5>   DW_AT_name        : (indirect string, offset: 0xe6): tm_mon	
    <c9>   DW_AT_decl_file   : 3	
    <ca>   DW_AT_decl_line   : 139	
    <cb>   DW_AT_type        : <0x57>	
    <cf>   DW_AT_data_member_location: 16	
 <2><d0>: Abbrev Number: 6 (DW_TAG_member)
    <d1>   DW_AT_name        : (indirect string, offset: 0x1ac): tm_year	
    <d5>   DW_AT_decl_file   : 3	
    <d6>   DW_AT_decl_line   : 140	
    <d7>   DW_AT_type        : <0x57>	
    <db>   DW_AT_data_member_location: 20	
 <2><dc>: Abbrev Number: 6 (DW_TAG_member)
    <dd>   DW_AT_name        : (indirect string, offset: 0xc6): tm_wday	
    <e1>   DW_AT_decl_file   : 3	
    <e2>   DW_AT_decl_line   : 141	
    <e3>   DW_AT_type        : <0x57>	
    <e7>   DW_AT_data_member_location: 24	
 <2><e8>: Abbrev Number: 6 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x1fa): tm_yday	
    <ed>   DW_AT_decl_file   : 3	
    <ee>   DW_AT_decl_line   : 142	
    <ef>   DW_AT_type        : <0x57>	
    <f3>   DW_AT_data_member_location: 28	
 <2><f4>: Abbrev Number: 6 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0x210): tm_isdst	
    <f9>   DW_AT_decl_file   : 3	
    <fa>   DW_AT_decl_line   : 143	
    <fb>   DW_AT_type        : <0x57>	
    <ff>   DW_AT_data_member_location: 32	
 <2><100>: Abbrev Number: 6 (DW_TAG_member)
    <101>   DW_AT_name        : (indirect string, offset: 0xce): tm_gmtoff	
    <105>   DW_AT_decl_file   : 3	
    <106>   DW_AT_decl_line   : 146	
    <107>   DW_AT_type        : <0x5e>	
    <10b>   DW_AT_data_member_location: 40	
 <2><10c>: Abbrev Number: 6 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0x0): tm_zone	
    <111>   DW_AT_decl_file   : 3	
    <112>   DW_AT_decl_line   : 147	
    <113>   DW_AT_type        : <0x119>	
    <117>   DW_AT_data_member_location: 48	
 <2><118>: Abbrev Number: 0
 <1><119>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <11a>   DW_AT_byte_size   : 8	
    <11b>   DW_AT_type        : <0x11f>	
 <1><11f>: Abbrev Number: 8 (DW_TAG_const_type)
    <120>   DW_AT_type        : <0x77>	
 <1><124>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <125>   DW_AT_byte_size   : 8	
    <126>   DW_AT_type        : <0x12a>	
 <1><12a>: Abbrev Number: 8 (DW_TAG_const_type)
    <12b>   DW_AT_type        : <0x57>	
 <1><12f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <130>   DW_AT_name        : (indirect string, offset: 0x242): field	
    <134>   DW_AT_byte_size   : 4	
    <135>   DW_AT_decl_file   : 4	
    <136>   DW_AT_decl_line   : 10	
    <137>   DW_AT_sibling     : <0x148>	
 <2><13b>: Abbrev Number: 6 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0x234): int_field_x	
    <140>   DW_AT_decl_file   : 4	
    <141>   DW_AT_decl_line   : 11	
    <142>   DW_AT_type        : <0x57>	
    <146>   DW_AT_data_member_location: 0	
 <2><147>: Abbrev Number: 0
 <1><148>: Abbrev Number: 9 (DW_TAG_structure_type)
    <149>   DW_AT_name        : (indirect string, offset: 0x15b): _mystruct	
    <14d>   DW_AT_byte_size   : 8	
    <14e>   DW_AT_decl_file   : 4	
    <14f>   DW_AT_decl_line   : 14	
    <150>   DW_AT_sibling     : <0x16d>	
 <2><154>: Abbrev Number: 6 (DW_TAG_member)
    <155>   DW_AT_name        : (indirect string, offset: 0x18d): int_x	
    <159>   DW_AT_decl_file   : 4	
    <15a>   DW_AT_decl_line   : 15	
    <15b>   DW_AT_type        : <0x57>	
    <15f>   DW_AT_data_member_location: 0	
 <2><160>: Abbrev Number: 6 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x240): myfield	
    <165>   DW_AT_decl_file   : 4	
    <166>   DW_AT_decl_line   : 16	
    <167>   DW_AT_type        : <0x12f>	
    <16b>   DW_AT_data_member_location: 4	
 <2><16c>: Abbrev Number: 0
 <1><16d>: Abbrev Number: 4 (DW_TAG_typedef)
    <16e>   DW_AT_name        : (indirect string, offset: 0x15c): mystruct	
    <172>   DW_AT_decl_file   : 4	
    <173>   DW_AT_decl_line   : 17	
    <174>   DW_AT_type        : <0x148>	
 <1><178>: Abbrev Number: 4 (DW_TAG_typedef)
    <179>   DW_AT_name        : (indirect string, offset: 0x44): t_tm	
    <17d>   DW_AT_decl_file   : 1	
    <17e>   DW_AT_decl_line   : 47	
    <17f>   DW_AT_type        : <0x89>	
 <1><183>: Abbrev Number: 4 (DW_TAG_typedef)
    <184>   DW_AT_name        : (indirect string, offset: 0x193): MyFunction	
    <188>   DW_AT_decl_file   : 1	
    <189>   DW_AT_decl_line   : 60	
    <18a>   DW_AT_type        : <0x18e>	
 <1><18e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18f>   DW_AT_byte_size   : 8	
    <190>   DW_AT_type        : <0x194>	
 <1><194>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <195>   DW_AT_prototyped  : 1	
    <195>   DW_AT_type        : <0x57>	
    <199>   DW_AT_sibling     : <0x1a3>	
 <2><19d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <19e>   DW_AT_type        : <0x57>	
 <2><1a2>: Abbrev Number: 0
 <1><1a3>: Abbrev Number: 12 (DW_TAG_subprogram)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x5c): static_function_should_not_be_identified_as_stub_target	
    <1a8>   DW_AT_decl_file   : 1	
    <1a9>   DW_AT_decl_line   : 4	
    <1aa>   DW_AT_prototyped  : 1	
    <1aa>   DW_AT_type        : <0x57>	
    <1ae>   DW_AT_low_pc      : 0x9f5	
    <1b6>   DW_AT_high_pc     : 0xe	
    <1be>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1c0>   DW_AT_GNU_all_call_sites: 1	
    <1c0>   DW_AT_sibling     : <0x1d1>	
 <2><1c4>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1c5>   DW_AT_name        : x	
    <1c7>   DW_AT_decl_file   : 1	
    <1c8>   DW_AT_decl_line   : 4	
    <1c9>   DW_AT_type        : <0x57>	
    <1cd>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1d0>: Abbrev Number: 0
 <1><1d1>: Abbrev Number: 14 (DW_TAG_subprogram)
    <1d2>   DW_AT_external    : 1	
    <1d2>   DW_AT_name        : (indirect string, offset: 0x2a): api1	
    <1d6>   DW_AT_decl_file   : 1	
    <1d7>   DW_AT_decl_line   : 9	
    <1d8>   DW_AT_prototyped  : 1	
    <1d8>   DW_AT_low_pc      : 0xa03	
    <1e0>   DW_AT_high_pc     : 0x19	
    <1e8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1ea>   DW_AT_GNU_all_tail_call_sites: 1	
    <1ea>   DW_AT_sibling     : <0x208>	
 <2><1ee>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1ef>   DW_AT_name        : x	
    <1f1>   DW_AT_decl_file   : 1	
    <1f2>   DW_AT_decl_line   : 9	
    <1f3>   DW_AT_type        : <0x57>	
    <1f7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1fa>: Abbrev Number: 15 (DW_TAG_subprogram)
    <1fb>   DW_AT_external    : 1	
    <1fb>   DW_AT_name        : (indirect string, offset: 0x1bc): puts	
    <1ff>   DW_AT_decl_file   : 5	
    <200>   DW_AT_decl_line   : 0	
    <201>   DW_AT_type        : <0x57>	
    <205>   DW_AT_declaration : 1	
 <3><205>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <3><206>: Abbrev Number: 0
 <2><207>: Abbrev Number: 0
 <1><208>: Abbrev Number: 14 (DW_TAG_subprogram)
    <209>   DW_AT_external    : 1	
    <209>   DW_AT_name        : (indirect string, offset: 0x16d): api1_constparam	
    <20d>   DW_AT_decl_file   : 1	
    <20e>   DW_AT_decl_line   : 14	
    <20f>   DW_AT_prototyped  : 1	
    <20f>   DW_AT_low_pc      : 0xa1c	
    <217>   DW_AT_high_pc     : 0x1a	
    <21f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <221>   DW_AT_GNU_all_tail_call_sites: 1	
    <221>   DW_AT_sibling     : <0x241>	
 <2><225>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <226>   DW_AT_name        : (indirect string, offset: 0x1e4): pc_x	
    <22a>   DW_AT_decl_file   : 1	
    <22b>   DW_AT_decl_line   : 14	
    <22c>   DW_AT_type        : <0x124>	
    <230>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><233>: Abbrev Number: 15 (DW_TAG_subprogram)
    <234>   DW_AT_external    : 1	
    <234>   DW_AT_name        : (indirect string, offset: 0x1bc): puts	
    <238>   DW_AT_decl_file   : 5	
    <239>   DW_AT_decl_line   : 0	
    <23a>   DW_AT_type        : <0x57>	
    <23e>   DW_AT_declaration : 1	
 <3><23e>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <3><23f>: Abbrev Number: 0
 <2><240>: Abbrev Number: 0
 <1><241>: Abbrev Number: 18 (DW_TAG_subprogram)
    <242>   DW_AT_external    : 1	
    <242>   DW_AT_name        : (indirect string, offset: 0x1e9): api1_pStructtype	
    <246>   DW_AT_decl_file   : 1	
    <247>   DW_AT_decl_line   : 19	
    <248>   DW_AT_prototyped  : 1	
    <248>   DW_AT_type        : <0x57>	
    <24c>   DW_AT_low_pc      : 0xa36	
    <254>   DW_AT_high_pc     : 0xf	
    <25c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <25e>   DW_AT_GNU_all_call_sites: 1	
    <25e>   DW_AT_sibling     : <0x271>	
 <2><262>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <263>   DW_AT_name        : (indirect string, offset: 0x279): param_struct	
    <267>   DW_AT_decl_file   : 1	
    <268>   DW_AT_decl_line   : 19	
    <269>   DW_AT_type        : <0x271>	
    <26d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><270>: Abbrev Number: 0
 <1><271>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <272>   DW_AT_byte_size   : 8	
    <273>   DW_AT_type        : <0x16d>	
 <1><277>: Abbrev Number: 18 (DW_TAG_subprogram)
    <278>   DW_AT_external    : 1	
    <278>   DW_AT_name        : (indirect string, offset: 0x1d4): api1_structtype	
    <27c>   DW_AT_decl_file   : 1	
    <27d>   DW_AT_decl_line   : 24	
    <27e>   DW_AT_prototyped  : 1	
    <27e>   DW_AT_type        : <0x57>	
    <282>   DW_AT_low_pc      : 0xa45	
    <28a>   DW_AT_high_pc     : 0xf	
    <292>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <294>   DW_AT_GNU_all_call_sites: 1	
    <294>   DW_AT_sibling     : <0x2a7>	
 <2><298>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <299>   DW_AT_name        : (indirect string, offset: 0x279): param_struct	
    <29d>   DW_AT_decl_file   : 1	
    <29e>   DW_AT_decl_line   : 24	
    <29f>   DW_AT_type        : <0x16d>	
    <2a3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><2a6>: Abbrev Number: 0
 <1><2a7>: Abbrev Number: 14 (DW_TAG_subprogram)
    <2a8>   DW_AT_external    : 1	
    <2a8>   DW_AT_name        : (indirect string, offset: 0x25a): api1_time	
    <2ac>   DW_AT_decl_file   : 1	
    <2ad>   DW_AT_decl_line   : 29	
    <2ae>   DW_AT_prototyped  : 1	
    <2ae>   DW_AT_low_pc      : 0xa54	
    <2b6>   DW_AT_high_pc     : 0x1a	
    <2be>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2c0>   DW_AT_GNU_all_tail_call_sites: 1	
    <2c0>   DW_AT_sibling     : <0x2d3>	
 <2><2c4>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <2c5>   DW_AT_name        : (indirect string, offset: 0xd8): timer	
    <2c9>   DW_AT_decl_file   : 1	
    <2ca>   DW_AT_decl_line   : 29	
    <2cb>   DW_AT_type        : <0x2d3>	
    <2cf>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><2d2>: Abbrev Number: 0
 <1><2d3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2d4>   DW_AT_byte_size   : 8	
    <2d5>   DW_AT_type        : <0x7e>	
 <1><2d9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <2da>   DW_AT_external    : 1	
    <2da>   DW_AT_name        : (indirect string, offset: 0x165): api1_tm	
    <2de>   DW_AT_decl_file   : 1	
    <2df>   DW_AT_decl_line   : 35	
    <2e0>   DW_AT_prototyped  : 1	
    <2e0>   DW_AT_type        : <0x89>	
    <2e4>   DW_AT_low_pc      : 0xa6e	
    <2ec>   DW_AT_high_pc     : 0x4f	
    <2f4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2f6>   DW_AT_GNU_all_call_sites: 1	
    <2f6>   DW_AT_sibling     : <0x309>	
 <2><2fa>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x209): arg_tm	
    <2ff>   DW_AT_decl_file   : 1	
    <300>   DW_AT_decl_line   : 35	
    <301>   DW_AT_type        : <0x89>	
    <305>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><308>: Abbrev Number: 0
 <1><309>: Abbrev Number: 19 (DW_TAG_subprogram)
    <30a>   DW_AT_external    : 1	
    <30a>   DW_AT_name        : (indirect string, offset: 0x2f): api1_return_ptr_struct_tm	
    <30e>   DW_AT_decl_file   : 1	
    <30f>   DW_AT_decl_line   : 41	
    <310>   DW_AT_type        : <0x326>	
    <314>   DW_AT_low_pc      : 0xabd	
    <31c>   DW_AT_high_pc     : 0xd	
    <324>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <326>   DW_AT_GNU_all_call_sites: 1	
 <1><326>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <327>   DW_AT_byte_size   : 8	
    <328>   DW_AT_type        : <0x89>	
 <1><32c>: Abbrev Number: 19 (DW_TAG_subprogram)
    <32d>   DW_AT_external    : 1	
    <32d>   DW_AT_name        : (indirect string, offset: 0x131): api1_return_ptr_typedef_tm	
    <331>   DW_AT_decl_file   : 1	
    <332>   DW_AT_decl_line   : 48	
    <333>   DW_AT_type        : <0x349>	
    <337>   DW_AT_low_pc      : 0xaca	
    <33f>   DW_AT_high_pc     : 0xb	
    <347>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <349>   DW_AT_GNU_all_call_sites: 1	
 <1><349>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <34a>   DW_AT_byte_size   : 8	
    <34b>   DW_AT_type        : <0x178>	
 <1><34f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <350>   DW_AT_external    : 1	
    <350>   DW_AT_name        : (indirect string, offset: 0x8): api_return_typedef_of_non_pointer	
    <354>   DW_AT_decl_file   : 1	
    <355>   DW_AT_decl_line   : 54	
    <356>   DW_AT_type        : <0x178>	
    <35a>   DW_AT_low_pc      : 0xad5	
    <362>   DW_AT_high_pc     : 0x49	
    <36a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <36c>   DW_AT_GNU_all_call_sites: 1	
    <36c>   DW_AT_sibling     : <0x380>	
 <2><370>: Abbrev Number: 21 (DW_TAG_variable)
    <371>   DW_AT_name        : ret	
    <375>   DW_AT_decl_file   : 1	
    <376>   DW_AT_decl_line   : 56	
    <377>   DW_AT_type        : <0x178>	
    <37b>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><37f>: Abbrev Number: 0
 <1><380>: Abbrev Number: 18 (DW_TAG_subprogram)
    <381>   DW_AT_external    : 1	
    <381>   DW_AT_name        : (indirect string, offset: 0x155): dummy	
    <385>   DW_AT_decl_file   : 1	
    <386>   DW_AT_decl_line   : 62	
    <387>   DW_AT_prototyped  : 1	
    <387>   DW_AT_type        : <0x57>	
    <38b>   DW_AT_low_pc      : 0xb1e	
    <393>   DW_AT_high_pc     : 0xe	
    <39b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <39d>   DW_AT_GNU_all_call_sites: 1	
    <39d>   DW_AT_sibling     : <0x3ae>	
 <2><3a1>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <3a2>   DW_AT_name        : x	
    <3a4>   DW_AT_decl_file   : 1	
    <3a5>   DW_AT_decl_line   : 62	
    <3a6>   DW_AT_type        : <0x57>	
    <3aa>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><3ad>: Abbrev Number: 0
 <1><3ae>: Abbrev Number: 18 (DW_TAG_subprogram)
    <3af>   DW_AT_external    : 1	
    <3af>   DW_AT_name        : (indirect string, offset: 0x17d): api1_return_pfn	
    <3b3>   DW_AT_decl_file   : 1	
    <3b4>   DW_AT_decl_line   : 67	
    <3b5>   DW_AT_prototyped  : 1	
    <3b5>   DW_AT_type        : <0x183>	
    <3b9>   DW_AT_low_pc      : 0xb2c	
    <3c1>   DW_AT_high_pc     : 0x10	
    <3c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3cb>   DW_AT_GNU_all_call_sites: 1	
    <3cb>   DW_AT_sibling     : <0x3dc>	
 <2><3cf>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <3d0>   DW_AT_name        : x	
    <3d2>   DW_AT_decl_file   : 1	
    <3d3>   DW_AT_decl_line   : 67	
    <3d4>   DW_AT_type        : <0x57>	
    <3d8>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><3db>: Abbrev Number: 0
 <1><3dc>: Abbrev Number: 22 (DW_TAG_variable)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x20b): g_tm	
    <3e1>   DW_AT_decl_file   : 1	
    <3e2>   DW_AT_decl_line   : 34	
    <3e3>   DW_AT_type        : <0x89>	
    <3e7>   DW_AT_external    : 1	
    <3e7>   DW_AT_location    : 9 byte block: 3 60 20 20 0 0 0 0 0 	(DW_OP_addr: 202060)
 <1><3f1>: Abbrev Number: 0
  Compilation Unit @ offset 0x3f2:
   Length:        0x118 (32-bit)
   Version:       4
   Abbrev Offset: 0x15c
   Pointer Size:  8
 <0><3fd>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <3fe>   DW_AT_producer    : (indirect string, offset: 0xed): GNU C 4.8.2 -mtune=generic -march=x86-64 -g -fPIC -fstack-protector	
    <402>   DW_AT_language    : 1	(ANSI C)
    <403>   DW_AT_name        : (indirect string, offset: 0x286): src/api2.c	
    <407>   DW_AT_comp_dir    : (indirect string, offset: 0x94): /home/ubuntu/work/stubgen-github/tests/sample-lib	
    <40b>   DW_AT_low_pc      : 0xb3c	
    <413>   DW_AT_high_pc     : 0x23	
    <41b>   DW_AT_stmt_list   : 0xc7	
 <1><41f>: Abbrev Number: 2 (DW_TAG_base_type)
    <420>   DW_AT_byte_size   : 8	
    <421>   DW_AT_encoding    : 7	(unsigned)
    <422>   DW_AT_name        : (indirect string, offset: 0x219): long unsigned int	
 <1><426>: Abbrev Number: 2 (DW_TAG_base_type)
    <427>   DW_AT_byte_size   : 1	
    <428>   DW_AT_encoding    : 8	(unsigned char)
    <429>   DW_AT_name        : (indirect string, offset: 0x19e): unsigned char	
 <1><42d>: Abbrev Number: 2 (DW_TAG_base_type)
    <42e>   DW_AT_byte_size   : 2	
    <42f>   DW_AT_encoding    : 7	(unsigned)
    <430>   DW_AT_name        : (indirect string, offset: 0x1c1): short unsigned int	
 <1><434>: Abbrev Number: 2 (DW_TAG_base_type)
    <435>   DW_AT_byte_size   : 4	
    <436>   DW_AT_encoding    : 7	(unsigned)
    <437>   DW_AT_name        : (indirect string, offset: 0x21e): unsigned int	
 <1><43b>: Abbrev Number: 2 (DW_TAG_base_type)
    <43c>   DW_AT_byte_size   : 1	
    <43d>   DW_AT_encoding    : 6	(signed char)
    <43e>   DW_AT_name        : (indirect string, offset: 0x1a0): signed char	
 <1><442>: Abbrev Number: 2 (DW_TAG_base_type)
    <443>   DW_AT_byte_size   : 2	
    <444>   DW_AT_encoding    : 5	(signed)
    <445>   DW_AT_name        : (indirect string, offset: 0x49): short int	
 <1><449>: Abbrev Number: 3 (DW_TAG_base_type)
    <44a>   DW_AT_byte_size   : 4	
    <44b>   DW_AT_encoding    : 5	(signed)
    <44c>   DW_AT_name        : int	
 <1><450>: Abbrev Number: 2 (DW_TAG_base_type)
    <451>   DW_AT_byte_size   : 8	
    <452>   DW_AT_encoding    : 5	(signed)
    <453>   DW_AT_name        : (indirect string, offset: 0x14c): long int	
 <1><457>: Abbrev Number: 2 (DW_TAG_base_type)
    <458>   DW_AT_byte_size   : 8	
    <459>   DW_AT_encoding    : 7	(unsigned)
    <45a>   DW_AT_name        : (indirect string, offset: 0x53): sizetype	
 <1><45e>: Abbrev Number: 2 (DW_TAG_base_type)
    <45f>   DW_AT_byte_size   : 1	
    <460>   DW_AT_encoding    : 6	(signed char)
    <461>   DW_AT_name        : (indirect string, offset: 0x1a7): char	
 <1><465>: Abbrev Number: 4 (DW_TAG_structure_type)
    <466>   DW_AT_name        : (indirect string, offset: 0x242): field	
    <46a>   DW_AT_byte_size   : 4	
    <46b>   DW_AT_decl_file   : 2	
    <46c>   DW_AT_decl_line   : 10	
    <46d>   DW_AT_sibling     : <0x47e>	
 <2><471>: Abbrev Number: 5 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x234): int_field_x	
    <476>   DW_AT_decl_file   : 2	
    <477>   DW_AT_decl_line   : 11	
    <478>   DW_AT_type        : <0x449>	
    <47c>   DW_AT_data_member_location: 0	
 <2><47d>: Abbrev Number: 0
 <1><47e>: Abbrev Number: 4 (DW_TAG_structure_type)
    <47f>   DW_AT_name        : (indirect string, offset: 0x15b): _mystruct	
    <483>   DW_AT_byte_size   : 8	
    <484>   DW_AT_decl_file   : 2	
    <485>   DW_AT_decl_line   : 14	
    <486>   DW_AT_sibling     : <0x4a3>	
 <2><48a>: Abbrev Number: 5 (DW_TAG_member)
    <48b>   DW_AT_name        : (indirect string, offset: 0x18d): int_x	
    <48f>   DW_AT_decl_file   : 2	
    <490>   DW_AT_decl_line   : 15	
    <491>   DW_AT_type        : <0x449>	
    <495>   DW_AT_data_member_location: 0	
 <2><496>: Abbrev Number: 5 (DW_TAG_member)
    <497>   DW_AT_name        : (indirect string, offset: 0x240): myfield	
    <49b>   DW_AT_decl_file   : 2	
    <49c>   DW_AT_decl_line   : 16	
    <49d>   DW_AT_type        : <0x465>	
    <4a1>   DW_AT_data_member_location: 4	
 <2><4a2>: Abbrev Number: 0
 <1><4a3>: Abbrev Number: 6 (DW_TAG_typedef)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x15c): mystruct	
    <4a8>   DW_AT_decl_file   : 2	
    <4a9>   DW_AT_decl_line   : 17	
    <4aa>   DW_AT_type        : <0x47e>	
 <1><4ae>: Abbrev Number: 7 (DW_TAG_subprogram)
    <4af>   DW_AT_external    : 1	
    <4af>   DW_AT_name        : (indirect string, offset: 0x291): api2	
    <4b3>   DW_AT_decl_file   : 1	
    <4b4>   DW_AT_decl_line   : 4	
    <4b5>   DW_AT_prototyped  : 1	
    <4b5>   DW_AT_low_pc      : 0xb3c	
    <4bd>   DW_AT_high_pc     : 0x19	
    <4c5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4c7>   DW_AT_GNU_all_tail_call_sites: 1	
    <4c7>   DW_AT_sibling     : <0x4e5>	
 <2><4cb>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <4cc>   DW_AT_name        : x	
    <4ce>   DW_AT_decl_file   : 1	
    <4cf>   DW_AT_decl_line   : 4	
    <4d0>   DW_AT_type        : <0x449>	
    <4d4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><4d7>: Abbrev Number: 9 (DW_TAG_subprogram)
    <4d8>   DW_AT_external    : 1	
    <4d8>   DW_AT_name        : (indirect string, offset: 0x1bc): puts	
    <4dc>   DW_AT_decl_file   : 3	
    <4dd>   DW_AT_decl_line   : 0	
    <4de>   DW_AT_type        : <0x449>	
    <4e2>   DW_AT_declaration : 1	
 <3><4e2>: Abbrev Number: 10 (DW_TAG_unspecified_parameters)
 <3><4e3>: Abbrev Number: 0
 <2><4e4>: Abbrev Number: 0
 <1><4e5>: Abbrev Number: 11 (DW_TAG_subprogram)
    <4e6>   DW_AT_external    : 1	
    <4e6>   DW_AT_name        : (indirect string, offset: 0x264): api2_structtype	
    <4ea>   DW_AT_decl_file   : 1	
    <4eb>   DW_AT_decl_line   : 9	
    <4ec>   DW_AT_prototyped  : 1	
    <4ec>   DW_AT_low_pc      : 0xb55	
    <4f4>   DW_AT_high_pc     : 0xa	
    <4fc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4fe>   DW_AT_GNU_all_call_sites: 1	
 <2><4fe>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <4ff>   DW_AT_name        : (indirect string, offset: 0x274): api2_param_struct	
    <503>   DW_AT_decl_file   : 1	
    <504>   DW_AT_decl_line   : 9	
    <505>   DW_AT_type        : <0x4a3>	
    <509>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><50c>: Abbrev Number: 0
 <1><50d>: Abbrev Number: 0
  Compilation Unit @ offset 0x50e:
   Length:        0xa3 (32-bit)
   Version:       4
   Abbrev Offset: 0x217
   Pointer Size:  8
 <0><519>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <51a>   DW_AT_producer    : (indirect string, offset: 0xed): GNU C 4.8.2 -mtune=generic -march=x86-64 -g -fPIC -fstack-protector	
    <51e>   DW_AT_language    : 1	(ANSI C)
    <51f>   DW_AT_name        : (indirect string, offset: 0x296): src/api3.c	
    <523>   DW_AT_comp_dir    : (indirect string, offset: 0x94): /home/ubuntu/work/stubgen-github/tests/sample-lib	
    <527>   DW_AT_low_pc      : 0xb5f	
    <52f>   DW_AT_high_pc     : 0x19	
    <537>   DW_AT_stmt_list   : 0x126	
 <1><53b>: Abbrev Number: 2 (DW_TAG_base_type)
    <53c>   DW_AT_byte_size   : 8	
    <53d>   DW_AT_encoding    : 7	(unsigned)
    <53e>   DW_AT_name        : (indirect string, offset: 0x219): long unsigned int	
 <1><542>: Abbrev Number: 2 (DW_TAG_base_type)
    <543>   DW_AT_byte_size   : 1	
    <544>   DW_AT_encoding    : 8	(unsigned char)
    <545>   DW_AT_name        : (indirect string, offset: 0x19e): unsigned char	
 <1><549>: Abbrev Number: 2 (DW_TAG_base_type)
    <54a>   DW_AT_byte_size   : 2	
    <54b>   DW_AT_encoding    : 7	(unsigned)
    <54c>   DW_AT_name        : (indirect string, offset: 0x1c1): short unsigned int	
 <1><550>: Abbrev Number: 2 (DW_TAG_base_type)
    <551>   DW_AT_byte_size   : 4	
    <552>   DW_AT_encoding    : 7	(unsigned)
    <553>   DW_AT_name        : (indirect string, offset: 0x21e): unsigned int	
 <1><557>: Abbrev Number: 2 (DW_TAG_base_type)
    <558>   DW_AT_byte_size   : 1	
    <559>   DW_AT_encoding    : 6	(signed char)
